Catalogs/бит_НазначениеЧастейПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_НазначениеЧастейПомещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКомнаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принадлежность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПринадлежностьКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/бит_ПринадлежностьКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ПринадлежностьКомнат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_НазначениеЧастейПомещения/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипКомнатыПриИзменении(Элемент)
	КоэффициентНачисленийЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура ПринадлежностьПриИзменении(Элемент)
	КоэффициентНачисленийЗаполнить();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура КоэффициентНачисленийЗаполнить()
	
	Если ЗначениеЗаполнено(Объект.ТипКомнаты) И Объект.ТипКомнаты = ПредопределенноеЗначение("Справочник.бит_ТипыКомнат.Жилая")
		И ЗначениеЗаполнено(Объект.Принадлежность) И Объект.Принадлежность = ПредопределенноеЗначение("Перечисление.бит_ПринадлежностьКомнат.Внутренняя") Тогда
		
		Объект.КоэффициентНачислений = 1;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
